## Set global configuration arguments
cask_args appdir: "~/Applications"

## Taps
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "universal-ctags/universal-ctags"

## Cask dependencies
brew "mas"
cask "java"
cask "xquartz"

## Shells
## Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"

## CLI utilities
## Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "curl"
#brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "gd"
brew "gh"
brew "git"
brew "glib"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "grep"
brew "hub"
brew "libiconv"
brew "libtool"
brew "legit"
#brew "gnu-sed", args: ["default-names"] # Install GNU `sed`, overwriting the built-in `sed`
brew "moreutils" # Install more useful GNU utilities like `sponge`
brew "openldap"
brew "openssh"
brew "openssl"
brew "openssl@1.1"
brew "pv"
brew "pwgen"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "ssh-copy-id"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

## Programming languages & Dev tools
brew "ansible"
brew "autoconf"
brew "automake"
brew "go"
brew "heroku/brew/heroku"
brew "rbenv" # Ruby
brew "ruby-build"
# brew "node" # Also installs `npm`
brew "nvm" # Node version manager
brew "multimarkdown" # Markdown
brew "mongodb-community" # MongoDB
brew "mysql", restart_service: true # MySQL DB
brew "php", restart_service: true
brew "postgres" # Postgres DB
brew "pyenv" # Python
brew "redis" # Redis DB
brew "shellcheck" # Bash and sh script linting

## Other useful tools
brew "highlight"
brew "multimarkdown"
brew "pandoc"
brew "pkg-config"
# brew "reattach-to-user-namespace"
# brew "xmlstarlet"
brew "yarn"
# brew "watchman"

## Image tools
brew "advancecomp"
brew "apngasm"
brew "ffmpeg"
brew "gifsicle"
brew "graphicsmagick"
brew "guetzli"
brew "icoutils"
brew "imagemagick"
brew "imageworsener"
brew "jhead"
brew "jpeg"
brew "jpeg-archive"
brew "jpegoptim"
brew "jpegrescan"
brew "libbpg"
brew "mozjpeg"
brew "optipng"
brew "perceptualdiff"
brew "pngcheck"
brew "pngcrush"
brew "pngnq"
brew "pngquant"
brew "webp"

## Compression tools
brew "brotli"
# brew "bzip2"
# brew "cabextract"
brew "gzip"
# brew "lbzip2"
# brew "lz4"
# brew "p7zip"
# brew "pbzip2"
# brew "pigz"
# brew "pixz"
# brew "snappy"
# brew "unar"
# brew "xz"
# brew "zopfli", args: ["HEAD"]

## Mac OS tools
brew "duti" # Required for setting preferences
# brew "imagesnap"
brew "mackup"
# brew "tccutil" # Required for setting preferences
# brew "trash"
brew "wifi-password"

## Server stack
# brew "httpd"
brew "dnsmasq", restart_service: true
brew "mkcert"
brew "nghttp2"
brew "nginx", restart_service: true
brew "nss"

## Network tools
# brew "aircrack-ng"
# brew "namebench"
# brew "nmap"
brew "speedtest_cli"
# brew "tor"

## Security tools
# brew "foremost"
# brew "hashpump"
# brew "sqlmap"

## Install applications
cask "adobe-acrobat-reader"
cask "adapter"
cask "amazon-music"
cask "amazon-photos"
cask "android-studio"
cask "appcleaner"
cask "coconutbattery"
cask "dash"
cask "docker"
cask "dropbox"
cask "epubquicklook"
cask "figma"
cask "google-backup-and-sync"
cask "grammarly"
cask "handbrake"
cask "hyper"
cask "imageoptim"
cask "iterm2"
cask "kap"
cask "keka"
cask "macupdater"
cask "makemkv"
cask "mkvtoolnix"
cask "marshallofsound-google-play-music-player"
cask "mark-text"
cask "nucleo"
cask "postman"
cask "remembear"
cask "screaming-frog-seo-spider"
cask "sequel-pro"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "typeface"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

## Browsers
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "microsoft-edge"
cask "opera"
cask "safari-technology-preview"

## Preference Panes
cask "hosts"

## Screensavers
cask "ios-saver"

## Services
cask "markdown-service-tools"

## QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"

## Color Picker plugins
cask "colorpicker-skalacolor"

## Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

## mas apps
# mas "Affinity Designer", id: 824171161
# mas "Affinity Photo", id: 824183456
# mas "Amphetamine", id: 937984704
# mas "Bear", id: 1091189122
# mas "Compressor", id: 424390742
# mas "Encrypto", id: 935235287
# mas "Final Cut Pro", id: 424389933
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "LittleIpsum", id: 405772121
# mas "Magnet", id: 441258766
# mas "Motion", id: 434290957
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Shazam", id: 897118787
# mas "Slack", id: 803453959
# mas "SnippetsLab", id: 1006087419
# mas "Speedtest", id: 1153157709
# mas "Surfshark", id: 1437809329
# mas "The Unarchiver", id: 425424353
# mas "Xcode", id: 497799835
