# Set global configuration arguments
cask_args appdir: "/Applications"

# Taps
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "joeyhoer/extras"
tap "universal-ctags/universal-ctags"
tap "heroku/brew"
tap "mongodb/brew"
tap "bramstein/webfonttools"

# Cask dependencies
brew "mas"
cask "java"
cask "xquartz"

# Shells
# Note: Don't forget to add shells to `/etc/shells` before running `chsh`.
brew "bash"
brew "zsh"

# CLI utilities
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "curl"
#brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "git"
brew "glib"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "github/gh/gh"
brew "grep"
brew "hub"
brew "libiconv"
#brew "gnu-sed", args: ["default-names"] # Install GNU `sed`, overwriting the built-in `sed`
brew "moreutils" # Install more useful GNU utilities like `sponge`
brew "openldap"
brew "openssh"
brew "openssl"
brew "openssl@1.1"
brew "pv"
brew "pwgen"
brew "ripgrep"
brew "rsync"
brew "screen"
brew "ssh-copy-id"
brew "starship"
brew "themekit"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"

# Other useful tools
brew "highlight"
brew "multimarkdown"
brew "pandoc"
brew "pkg-config"
brew "reattach-to-user-namespace"
brew "xmlstarlet"

# Image tools
brew "advancecomp"
brew "apngasm"
brew "ffmpeg"
brew "gifsicle"
brew "joeyhoer/extras/gifv", args: ["HEAD"]
brew "graphicsmagick"
brew "guetzli"
brew "icoutils"
brew "imagemagick", args: ["with-fftw", "with-hdri", "with-liblqr", "with-librsvg", "with-opencl", "with-openmp", "with-webp"]
brew "imageworsener"
brew "jhead"
brew "joeyhoer/extras/apngdis"
brew "joeyhoer/extras/crunchme"
brew "joeyhoer/extras/flif", args: ["with-apng", "with-gif"]
brew "joeyhoer/extras/gifify", args: ["HEAD"]
brew "joeyhoer/extras/mediancut-posterizer"
brew "joeyhoer/extras/nice-screenshot", args: ["HEAD"]
brew "joeyhoer/extras/pngout"
brew "joeyhoer/extras/pngwolf-zopfli", args: ["HEAD"]
brew "joeyhoer/extras/video-poster", args: ["HEAD"]
brew "jpeg"
brew "jpeg-archive"
brew "jpegoptim"
brew "jpegrescan"
brew "libbpg"
brew "mozjpeg"
brew "optipng"
brew "perceptualdiff"
brew "pngcheck"
brew "pngcrush"
brew "pngnq"
brew "pngquant"
brew "webp"

# Compression tools
brew "brotli"
brew "bzip2"
brew "cabextract"
brew "gzip"
brew "joeyhoer/extras/gzthermal"
brew "joeyhoer/extras/huffmix"
brew "joeyhoer/extras/kzipmix"
brew "lbzip2"
brew "lz4"
brew "p7zip"
brew "pbzip2"
brew "pigz"
brew "pixz"
brew "snappy"
brew "unar"
brew "xz"
brew "zopfli", args: ["HEAD"]

# Mac OS tools
brew "duti" # Required for setting preferences
brew "imagesnap"
brew "mackup"
brew "tccutil" # Required for setting preferences
brew "trash"
brew "wifi-password"

# Server stack
brew "httpd"
brew "dnsmasq"
brew "nghttp2"
brew "nginx"
brew "percona-server"

# Programming languages & Dev tools
# Installing Python/Ruby with Homebrew is unnecessary,
# as they will be installed and managed via pyenv/rbenv respectively
brew "go"
brew "heroku/brew/heroku"
brew "rbenv" # Ruby
brew "ruby-build"
brew "node" # Also installs `npm`
brew "nvm" # Node version manager
brew "multimarkdown" # Markdown
brew "mongodb-community" # MongoDB
brew "mysql" # MySQL DB
brew "php"
brew "postgres" # Postgres DB
brew "pyenv" # Python
brew "redis" # Redis DB
brew "shellcheck" # Bash and sh script linting

# Network tools
brew "aircrack-ng"
brew "namebench"
brew "nmap"
brew "speedtest_cli"
brew "tor"

# Security tools
brew "foremost"
brew "hashpump"
brew "sqlmap"

# Install applications
cask "adobe-acrobat-reader"
cask "adapter"
cask "airserver"
cask "amazon-music"
cask "amazon-photos"
cask "android-studio"
cask "appcleaner"
cask "colors"
cask "coconutbattery"
cask "dash"
cask "docker"
cask "dropbox"
cask "epubquicklook"
cask "expressvpn"
cask "google-backup-and-sync"
cask "grammarly"
cask "hyper"
cask "imagealpha"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "jdownloader"
cask "kap"
cask "keka"
cask "macupdater"
cask "marshallofsound-google-play-music-player"
cask "mark-text"
cask "megasync"
cask "nucleo"
cask "postman"
cask "remembear"
cask "rocket"
cask "sequel-pro"
cask "sketch"
cask "sketchpacks"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# Browsers
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "microsoft-edge"
cask "opera"
cask "safari-technology-preview"
cask "tor-browser"

# Virtulization applications
cask "vagrant"
cask "vagrant-manager"

# Preference Panes
cask "hosts"

# Screensavers
cask "ios-saver"

# Services
cask "markdown-service-tools"

# QuickLook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"

# Color Picker plugins
cask "colorpicker-skalacolor"

# Fonts
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
cask "font-anonymous-pro"
cask "font-bebas-neue"
cask "font-comic-neue"
cask "font-dejavu-sans"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-jetbrains-mono"
cask "font-jetbrainsmono-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"
cask "font-league-gothic"
cask "font-liberation-sans"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-symbola"
cask "joeyhoer/extras/font-microsoft-office"
cask "joeyhoer/extras/font-san-francisco-compact"